# Переменная - это коробка с названием в которуой лежи значение. x = 5, x = "Иван", x =3.14, x = True, x = [1, 2, 3], x = (1, 2, 3), x = {1, 2, 3}, x = None.

# Ввод данных input - это команда которая ждет пока кто либо не напишет что либо. x = input(), age = input("Сколько тебе лет? ")

# Типы данных: int(-7,-6,-5,-4, ... , 0,1,2,3,4,5,6,7, ...), float(3.14, 0.5, 2.71, -0.5), str("Name"), bool(True, False) 

# Условия (if, elif, else) - это команда которая проверяет условие и выполняет код если условие верно. (==)-равно, (!=)-не равно, (>) - больше, (<) - меньше, (>=) - больше или равно, (<=) - меньше или равно.

# if age >= 18:
#     print("Ты взрослый")
# elif age >= 12:
#     print("Ты подросток")
# else:
#     print("Ты ребенок")



# name = input("Как тебя зовут? ")
# print("Привет, " + name + "! Рад тебя видеть!")


name = "Вова"
age = 34

print("Привет, меня зовут" + name + "Мне " + str(age) + " лет")

stolica = "Моксва"
Strana = "России"
age_strana = 34

print("Столица России - " + stolica)

print("Стране " + Strana + " - " + str(age) + " года")

# Меня зовут ... , мне ...
# Моего брата звать ... , ему ...
